Revit 2024 API
DuctFittingAndAccessoryData.ServerGUID Property
 The GUID of the duct fitting or duct accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Guid ServerGUID { get; }
Visual Basic
Public ReadOnly Property ServerGUID As Guid
	Get
Visual C++
public:
property Guid ServerGUID {
	Guid get ();
}
See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace